Revit 2026 API
RibbonPanel Class
Represents a panel added by an External Application or External Command into the Add-Ins tab.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonPanel
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class RibbonPanel
Public Class RibbonPanel
public ref class RibbonPanel
type RibbonPanel = class end
The RibbonPanel type exposes the following members.
Properties
Name | Description
Enabled | Gets or sets a value indicating whether the RibbonPanel can respond to user interaction.
Name | Gets or sets the name of the RibbonPanel.
Title | Gets or sets the text of the RibbonPanel.
Visible | Gets or sets a value indicating whether the RibbonPanel is displayed.
Top
Methods
Name | Description
AddItem |  Adds a Ribbon item to the panel.
AddSeparator | Adds a new Separator to the panel.
AddSlideOut |  Adds a slideout to the current panel.
AddStackedItems(RibbonItemData, RibbonItemData) |  Adds two stacked items to the panel.
AddStackedItems(RibbonItemData, RibbonItemData, RibbonItemData) |  Adds three stacked items to the panel.
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetItems | Gets a copy of the collection of RibbonItems assigned to the RibbonPanel.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
The Panel class provides read and write access to the RibbonItems contained in the panel. Use of this class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace